---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Erase(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction)
source: html/b029f89f-7480-6d7f-4edb-16dcc6ff7a37.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Erase Method

Removes a specified MEPBuildingConstruction from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	MEPBuildingConstruction item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction`) - The MEPBuildingConstruction to be erased.

## Returns
The number of MEPBuildingConstructions that were erased from the set.